FI/Lääkitystiedot/Integraatiopalvelu_Lääkitystiedot_Palvelukuvaus_1.0.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="MedicationService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Medication.DataContracts"/><xs:element name="GetMedicationDataRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="MessageHeader" nillable="true" type="q1:MessageHeader" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="Common" nillable="true" type="q2:LisCommon" xmlns:q2="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="MedicationReq" nillable="true" type="q3:MedicationReq" xmlns:q3="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Medication.DataContracts"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetMedicationDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="AcknowledgeRequestStatus" nillable="true" type="q4:AcknowledgeRequestStatus" xmlns:q4="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="MessageHeader" nillable="true" type="q5:MessageHeader" xmlns:q5="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="PatientMedications" nillable="true" type="q6:ArrayOfPatientMedication" xmlns:q6="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Medication.DataContracts"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"><xs:complexType name="MessageHeader"><xs:sequence><xs:element minOccurs="0" name="MessageID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="TransactionID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderApplication" nillable="true" type="xs:string"/><xs:element name="ReceiverID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReceiverApplication" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CharacterSet" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DataServiceURL" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserLanguageCode" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="VersionNumber" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="MessageHeader" nillable="true" type="tns:MessageHeader"/><xs:complexType name="LisCommon"><xs:sequence><xs:element minOccurs="0" name="ContractKey" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserId" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingSystem" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingUserId" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="LisCommon" nillable="true" type="tns:LisCommon"/><xs:complexType name="AcknowledgeRequestStatus"><xs:sequence><xs:element minOccurs="0" name="HasOperationFailed" type="xs:boolean"/><xs:element minOccurs="0" name="ErrorType" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ErrorMessage" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="AcknowledgeRequestStatus" nillable="true" type="tns:AcknowledgeRequestStatus"/><xs:complexType name="LisFaultInfo"><xs:sequence><xs:element minOccurs="0" name="Description" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Message" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="LisFaultInfo" nillable="true" type="tns:LisFaultInfo"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Medication.DataContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Medication.DataContracts"><xs:complexType name="MedicationReq"><xs:sequence><xs:element minOccurs="0" name="Organisation" nillable="true" type="tns:Code"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="Area" nillable="true" type="tns:Code"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element name="PatientId" nillable="true" type="tns:PatientId"/></xs:sequence></xs:complexType><xs:element name="MedicationReq" nillable="true" type="tns:MedicationReq"/><xs:complexType name="Code"><xs:sequence><xs:element minOccurs="0" name="CodeSetName" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="CodeSetId" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="CodeValue" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="CodeDescription" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="Code" nillable="true" type="tns:Code"/><xs:complexType name="PatientId"><xs:sequence><xs:element name="Identifier" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="PatientId" nillable="true" type="tns:PatientId"/><xs:complexType name="ArrayOfPatientMedication"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="PatientMedication" nillable="true" type="tns:PatientMedication"/></xs:sequence></xs:complexType><xs:element name="ArrayOfPatientMedication" nillable="true" type="tns:ArrayOfPatientMedication"/><xs:complexType name="PatientMedication"><xs:sequence><xs:element minOccurs="0" name="ActivityTime" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="Authority" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="BeginTime" type="xs:dateTime"/><xs:element minOccurs="0" name="DeliveryRoute" nillable="true" type="tns:RouteOfAdminisration"/><xs:element minOccurs="0" name="Dosages" nillable="true" type="tns:ArrayOfDosage"/><xs:element minOccurs="0" name="EndTime" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="Id" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Medicine" nillable="true" type="tns:Medicine"/><xs:element minOccurs="0" name="OrderedBy" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="PatientId" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="PatientMedication" nillable="true" type="tns:PatientMedication"/><xs:complexType name="RouteOfAdminisration"><xs:complexContent mixed="false"><xs:extension base="tns:CodedValue"><xs:sequence/></xs:extension></xs:complexContent></xs:complexType><xs:element name="RouteOfAdminisration" nillable="true" type="tns:RouteOfAdminisration"/><xs:complexType name="CodedValue"><xs:sequence><xs:element minOccurs="0" name="Code" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Description" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="CodedValue" nillable="true" type="tns:CodedValue"/><xs:complexType name="ArrayOfDosage"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Dosage" nillable="true" type="tns:Dosage"/></xs:sequence></xs:complexType><xs:element name="ArrayOfDosage" nillable="true" type="tns:ArrayOfDosage"/><xs:complexType name="Dosage"><xs:sequence><xs:element minOccurs="0" name="Authority" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DosageBeginTime" type="xs:dateTime"/><xs:element minOccurs="0" name="DosageEndTime" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="DosageForm" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DosageId" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DosageNotes" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DosageShortForm" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DosageText" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="MedicationType" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="OnHold" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="OrderedBy" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Dosage" nillable="true" type="tns:Dosage"/><xs:complexType name="Medicine"><xs:sequence><xs:element minOccurs="0" name="AtcCode" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="EffectiveSubstances" nillable="true" type="tns:ArrayOfEffectiveSubstance"/><xs:element minOccurs="0" name="MedicineFormat" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Id" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="MedicineName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="PackageSize" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Strength" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="StrengthNum" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="StrengthUnit" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="VnrCode" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Medicine" nillable="true" type="tns:Medicine"/><xs:complexType name="ArrayOfEffectiveSubstance"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="EffectiveSubstance" nillable="true" type="tns:EffectiveSubstance"/></xs:sequence></xs:complexType><xs:element name="ArrayOfEffectiveSubstance" nillable="true" type="tns:ArrayOfEffectiveSubstance"/><xs:complexType name="EffectiveSubstance"><xs:sequence><xs:element minOccurs="0" name="Code" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Id" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Strength" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="StrengthUnit" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SubstanceName" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="EffectiveSubstance" nillable="true" type="tns:EffectiveSubstance"/></xs:schema></wsdl:types><wsdl:message name="GetMedicationDataRequest"><wsdl:part name="parameters" element="tns:GetMedicationDataRequest"/></wsdl:message><wsdl:message name="GetMedicationDataResponse"><wsdl:part name="parameters" element="tns:GetMedicationDataResponse"/></wsdl:message><wsdl:message name="IMedicationService_GetOpenCareMedicationData_LisFaultInfoFault_FaultMessage"><wsdl:part name="detail" element="q1:LisFaultInfo" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/></wsdl:message><wsdl:portType name="IMedicationService"><wsdl:operation name="GetOpenCareMedicationData"><wsdl:input wsaw:Action="http://tempuri.org/IMedicationService/GetOpenCareMedicationData" name="GetMedicationDataRequest" message="tns:GetMedicationDataRequest"/><wsdl:output wsaw:Action="http://tempuri.org/IMedicationService/GetOpenCareMedicationDataResponse" name="GetMedicationDataResponse" message="tns:GetMedicationDataResponse"/><wsdl:fault wsaw:Action="http://tempuri.org/IMedicationService/GetOpenCareMedicationDataLisFaultInfoFault" name="LisFaultInfoFault" message="tns:IMedicationService_GetOpenCareMedicationData_LisFaultInfoFault_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IMedicationService" type="tns:IMedicationService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetOpenCareMedicationData"><soap:operation soapAction="http://tempuri.org/IMedicationService/GetOpenCareMedicationData" style="document"/><wsdl:input name="GetMedicationDataRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="GetMedicationDataResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="LisFaultInfoFault"><soap:fault use="literal" name="LisFaultInfoFault" namespace=""/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="MedicationService"><wsdl:port name="BasicHttpBinding_IMedicationService" binding="tns:BasicHttpBinding_IMedicationService"><soap:address location="http://localhost:4294/MedicationService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>